app/controllers/sessions_controller.rb

  def create
    user = User.find_by_username( params[:sessions][:username] )
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'John' LIMIT 1