app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    if is_signed_in?
      @user = User.find( current_user.id )

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sat, 07 Jan 2012 18:00:34 UTC +00:00], ["updated_at", Sat, 07 Jan 2012 18:00:34 UTC +00:00], ["username", "John"]]
---
  def create
    @user = User.create(params[:user])